yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al31e89.h
#define MASK_PI_DDR_DDR0         0x01
#define MASK_PI_DDR_DDR1         0x02
#define MASK_PI_DDR_DDR2         0x04
#define MASK_PI_DDR_DDR3         0x08
#define MASK_PI_DDR_DDR4         0x10
#define MASK_PI_DDR_DDR5         0x20
#define MASK_PI_DDR_DDR6         0x40
#define MASK_PI_DDR_DDR7         0x80

#define MASK_PI_CR1_C10          0x01
#define MASK_PI_CR1_C11          0x02
#define MASK_PI_CR1_C12          0x04
#define MASK_PI_CR1_C13          0x08
#define MASK_PI_CR1_C14          0x10
#define MASK_PI_CR1_C15          0x20
#define MASK_PI_CR1_C16          0x40
#define MASK_PI_CR1_C17          0x80

#define MASK_PI_CR2_C20          0x01
#define MASK_PI_CR2_C21          0x02
#define MASK_PI_CR2_C22          0x04
#define MASK_PI_CR2_C23          0x08
#define MASK_PI_CR2_C24          0x10
#define MASK_PI_CR2_C25          0x20
#define MASK_PI_CR2_C26          0x40
#define MASK_PI_CR2_C27          0x80


/*-------------------------------------------------------------------------
 *      Flash register definitions
 *-----------------------------------------------------------------------*/
/* Flash control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char FIX         : 1;
  unsigned char IE          : 1;
  unsigned char WAITM       : 1;
  unsigned char EEPM        : 1;
} __BITS_FLASH_CR1;
#endif
__IO_REG8_BIT(FLASH_CR1,   0x5050, __READ_WRITE, __BITS_FLASH_CR1);

/* Flash control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PRG         : 1;
  unsigned char             : 3;
  unsigned char FPRG        : 1;
  unsigned char ERASE       : 1;
  unsigned char WPRG        : 1;
  unsigned char OPT         : 1;
} __BITS_FLASH_CR2;
#endif
__IO_REG8_BIT(FLASH_CR2,   0x5051, __READ_WRITE, __BITS_FLASH_CR2);

/* Flash program memory unprotection key register */
__IO_REG8    (FLASH_PUKR,  0x5052, __READ_WRITE);
/* Data EEPROM unprotection key register */
__IO_REG8    (FLASH_DUKR,  0x5053, __READ_WRITE);
/* Flash in-application programming status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char WR_PG_DIS   : 1;
  unsigned char PUL         : 1;
  unsigned char EOP         : 1;
  unsigned char DUL         : 1;
  unsigned char             : 2;
  unsigned char HVOFF       : 1;
} __BITS_FLASH_IAPSR;
#endif
__IO_REG8_BIT(FLASH_IAPSR, 0x5054, __READ_WRITE, __BITS_FLASH_IAPSR);


/*-------------------------------------------------------------------------
 *      Flash bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define FLASH_CR1_FIX            FLASH_CR1_bit.FIX
#define FLASH_CR1_IE             FLASH_CR1_bit.IE
#define FLASH_CR1_WAITM          FLASH_CR1_bit.WAITM
#define FLASH_CR1_EEPM           FLASH_CR1_bit.EEPM

#define FLASH_CR2_PRG            FLASH_CR2_bit.PRG
#define FLASH_CR2_FPRG           FLASH_CR2_bit.FPRG
#define FLASH_CR2_ERASE          FLASH_CR2_bit.ERASE
#define FLASH_CR2_WPRG           FLASH_CR2_bit.WPRG
#define FLASH_CR2_OPT            FLASH_CR2_bit.OPT

#define FLASH_IAPSR_WR_PG_DIS    FLASH_IAPSR_bit.WR_PG_DIS
#define FLASH_IAPSR_PUL          FLASH_IAPSR_bit.PUL
#define FLASH_IAPSR_EOP          FLASH_IAPSR_bit.EOP
#define FLASH_IAPSR_DUL          FLASH_IAPSR_bit.DUL
#define FLASH_IAPSR_HVOFF        FLASH_IAPSR_bit.HVOFF

#endif

/*-------------------------------------------------------------------------
 *      Flash bit masks
 *-----------------------------------------------------------------------*/
#define MASK_FLASH_CR1_FIX       0x01
#define MASK_FLASH_CR1_IE        0x02
#define MASK_FLASH_CR1_WAITM     0x04
#define MASK_FLASH_CR1_EEPM      0x08

#define MASK_FLASH_CR2_PRG       0x01
#define MASK_FLASH_CR2_FPRG      0x10
#define MASK_FLASH_CR2_ERASE     0x20
#define MASK_FLASH_CR2_WPRG      0x40
#define MASK_FLASH_CR2_OPT       0x80

#define MASK_FLASH_IAPSR_WR_PG_DIS 0x01
#define MASK_FLASH_IAPSR_PUL     0x02
#define MASK_FLASH_IAPSR_EOP     0x04
#define MASK_FLASH_IAPSR_DUL     0x08
#define MASK_FLASH_IAPSR_HVOFF   0x40


/*-------------------------------------------------------------------------
 *      DMA1 register definitions
 *-----------------------------------------------------------------------*/
/* DMA1 global configuration & status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char GEN         : 1;
  unsigned char GB          : 1;
  unsigned char TO          : 6;
} __BITS_DMA1_GCSR;
#endif
__IO_REG8_BIT(DMA1_GCSR,   0x5070, __READ_WRITE, __BITS_DMA1_GCSR);

/* DMA1 global interrupt register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char IFC0        : 1;
  unsigned char IFC1        : 1;
  unsigned char IFC2        : 1;
  unsigned char IFC3        : 1;
} __BITS_DMA1_GIR1;
#endif
__IO_REG8_BIT(DMA1_GIR1,   0x5071, __READ, __BITS_DMA1_GIR1);

/* DMA1 channel 0 configuration register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EN          : 1;
  unsigned char TCIE        : 1;
  unsigned char HTIE        : 1;
  unsigned char DIR         : 1;
  unsigned char CIRC        : 1;
  unsigned char MINCDEC     : 1;
} __BITS_DMA1_C0CR;
#endif
__IO_REG8_BIT(DMA1_C0CR,   0x5075, __READ_WRITE, __BITS_DMA1_C0CR);

/* DMA1 channel 0 status */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char TCIF        : 1;
  unsigned char HTIF        : 1;
  unsigned char TSIZE       : 1;
  unsigned char PL0         : 1;
  unsigned char PL1         : 1;
  unsigned char PEND        : 1;
  unsigned char BUSY        : 1;
} __BITS_DMA1_C0SPR;
#endif
__IO_REG8_BIT(DMA1_C0SPR,  0x5076, __READ_WRITE, __BITS_DMA1_C0SPR);

/* DMA1 number of data to transfer register (channel 0) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char NDT0        : 1;
  unsigned char NDT1        : 1;
  unsigned char NDT2        : 1;
  unsigned char NDT3        : 1;
  unsigned char NDT4        : 1;
  unsigned char NDT5        : 1;
  unsigned char NDT6        : 1;
  unsigned char NDT7        : 1;
} __BITS_DMA1_C0NDTR;
#endif
__IO_REG8_BIT(DMA1_C0NDTR, 0x5077, __READ_WRITE, __BITS_DMA1_C0NDTR);

/* DMA1 peripheral address high register (channel 0) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PA8         : 1;
  unsigned char PA9         : 1;
  unsigned char PA10        : 1;
  unsigned char PA11        : 1;
  unsigned char PA12        : 1;
  unsigned char PA13        : 1;
  unsigned char PA14        : 1;
  unsigned char PA15        : 1;
} __BITS_DMA1_C0PARH;
#endif
__IO_REG8_BIT(DMA1_C0PARH, 0x5078, __READ_WRITE, __BITS_DMA1_C0PARH);

/* DMA1 peripheral address low register (channel 0) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PA0         : 1;
  unsigned char PA1         : 1;
  unsigned char PA2         : 1;
  unsigned char PA3         : 1;
  unsigned char PA4         : 1;
  unsigned char PA5         : 1;
  unsigned char PA6         : 1;
  unsigned char PA7         : 1;
} __BITS_DMA1_C0PARL;
#endif
__IO_REG8_BIT(DMA1_C0PARL, 0x5079, __READ_WRITE, __BITS_DMA1_C0PARL);

/* DMA1 memory 0 address high register (channel 0) */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char M0A8        : 1;
  unsigned char M0A9        : 1;
  unsigned char M0A10       : 1;
  unsigned char M0A11       : 1;
  unsigned char M0A12       : 1;
  unsigned char M0A13       : 1;
  unsigned char M0A14       : 1;
  unsigned char M0A15       : 1;
} __BITS_DMA1_C0M0ARH;
#endif
__IO_REG8_BIT(DMA1_C0M0ARH, 0x507B, __READ_WRITE, __BITS_DMA1_C0M0ARH);

