yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8al31e89.h
#define MASK_ADC1_CR2_SMTP1      0x07
#define MASK_ADC1_CR2_EXTSEL0    0x08
#define MASK_ADC1_CR2_EXTSEL1    0x10
#define MASK_ADC1_CR2_TRIG_EDGE0 0x20
#define MASK_ADC1_CR2_TRIG_EDGE1 0x40
#define MASK_ADC1_CR2_PRESC      0x80

#define MASK_ADC1_CR3_CHSEL      0x1F
#define MASK_ADC1_CR3_SMTP2      0xE0

#define MASK_ADC1_SR_EOC         0x01
#define MASK_ADC1_SR_AWD         0x02
#define MASK_ADC1_SR_OVER        0x04

#define MASK_ADC1_DRH_CONV_DATA8 0x01
#define MASK_ADC1_DRH_CONV_DATA9 0x02
#define MASK_ADC1_DRH_CONV_DATA10 0x04
#define MASK_ADC1_DRH_CONV_DATA11 0x08

#define MASK_ADC1_DRL_CONV_DATA0 0x01
#define MASK_ADC1_DRL_CONV_DATA1 0x02
#define MASK_ADC1_DRL_CONV_DATA2 0x04
#define MASK_ADC1_DRL_CONV_DATA3 0x08
#define MASK_ADC1_DRL_CONV_DATA4 0x10
#define MASK_ADC1_DRL_CONV_DATA5 0x20
#define MASK_ADC1_DRL_CONV_DATA6 0x40
#define MASK_ADC1_DRL_CONV_DATA7 0x80

#define MASK_ADC1_HTRH_HT8       0x01
#define MASK_ADC1_HTRH_HT9       0x02
#define MASK_ADC1_HTRH_HT10      0x04
#define MASK_ADC1_HTRH_HT11      0x08

#define MASK_ADC1_HTRL_HT0       0x01
#define MASK_ADC1_HTRL_HT1       0x02
#define MASK_ADC1_HTRL_HT2       0x04
#define MASK_ADC1_HTRL_HT3       0x08
#define MASK_ADC1_HTRL_HT4       0x10
#define MASK_ADC1_HTRL_HT5       0x20
#define MASK_ADC1_HTRL_HT6       0x40
#define MASK_ADC1_HTRL_HT7       0x80

#define MASK_ADC1_LTRH_LT8       0x01
#define MASK_ADC1_LTRH_LT9       0x02
#define MASK_ADC1_LTRH_LT10      0x04
#define MASK_ADC1_LTRH_LT11      0x08

#define MASK_ADC1_LTRL_LT0       0x01
#define MASK_ADC1_LTRL_LT1       0x02
#define MASK_ADC1_LTRL_LT2       0x04
#define MASK_ADC1_LTRL_LT3       0x08
#define MASK_ADC1_LTRL_LT4       0x10
#define MASK_ADC1_LTRL_LT5       0x20
#define MASK_ADC1_LTRL_LT6       0x40
#define MASK_ADC1_LTRL_LT7       0x80

#define MASK_ADC1_SQR1_CHSEL_S24 0x01
#define MASK_ADC1_SQR1_CHSEL_S25 0x02
#define MASK_ADC1_SQR1_CHSEL_S26 0x04
#define MASK_ADC1_SQR1_CHSEL_S27 0x08
#define MASK_ADC1_SQR1_CHSEL_S28 0x10
#define MASK_ADC1_SQR1_CHSEL_S29 0x20
#define MASK_ADC1_SQR1_DMAOFF    0x80

#define MASK_ADC1_SQR2_CHSEL_S16 0x01
#define MASK_ADC1_SQR2_CHSEL_S17 0x02
#define MASK_ADC1_SQR2_CHSEL_S18 0x04
#define MASK_ADC1_SQR2_CHSEL_S19 0x08
#define MASK_ADC1_SQR2_CHSEL_S20 0x10
#define MASK_ADC1_SQR2_CHSEL_S21 0x20
#define MASK_ADC1_SQR2_CHSEL_S22 0x40
#define MASK_ADC1_SQR2_CHSEL_S23 0x80

#define MASK_ADC1_SQR3_CHSEL_S8  0x01
#define MASK_ADC1_SQR3_CHSEL_S9  0x02
#define MASK_ADC1_SQR3_CHSEL_S10 0x04
#define MASK_ADC1_SQR3_CHSEL_S11 0x08
#define MASK_ADC1_SQR3_CHSEL_S12 0x10
#define MASK_ADC1_SQR3_CHSEL_S13 0x20
#define MASK_ADC1_SQR3_CHSEL_S14 0x40
#define MASK_ADC1_SQR3_CHSEL_S15 0x80

#define MASK_ADC1_SQR4_CHSEL_S0  0x01
#define MASK_ADC1_SQR4_CHSEL_S1  0x02
#define MASK_ADC1_SQR4_CHSEL_S2  0x04
#define MASK_ADC1_SQR4_CHSEL_S3  0x08
#define MASK_ADC1_SQR4_CHSEL_S4  0x10
#define MASK_ADC1_SQR4_CHSEL_S5  0x20
#define MASK_ADC1_SQR4_CHSEL_S6  0x40
#define MASK_ADC1_SQR4_CHSEL_S7  0x80

#define MASK_ADC1_TRIGR1_TRIG24  0x01
#define MASK_ADC1_TRIGR1_TRIG25  0x02
#define MASK_ADC1_TRIGR1_TRIG26  0x04
#define MASK_ADC1_TRIGR1_TRIG27  0x08
#define MASK_ADC1_TRIGR1_VREFINTON 0x10
#define MASK_ADC1_TRIGR1_TSON    0x20

#define MASK_ADC1_TRIGR2_TRIG16  0x01
#define MASK_ADC1_TRIGR2_TRIG17  0x02
#define MASK_ADC1_TRIGR2_TRIG18  0x04
#define MASK_ADC1_TRIGR2_TRIG19  0x08
#define MASK_ADC1_TRIGR2_TRIG20  0x10
#define MASK_ADC1_TRIGR2_TRIG21  0x20
#define MASK_ADC1_TRIGR2_TRIG22  0x40
#define MASK_ADC1_TRIGR2_TRIG23  0x80

#define MASK_ADC1_TRIGR3_TRIG8   0x01
#define MASK_ADC1_TRIGR3_TRIG9   0x02
#define MASK_ADC1_TRIGR3_TRIG10  0x04
#define MASK_ADC1_TRIGR3_TRIG11  0x08
#define MASK_ADC1_TRIGR3_TRIG12  0x10
#define MASK_ADC1_TRIGR3_TRIG13  0x20
#define MASK_ADC1_TRIGR3_TRIG14  0x40
#define MASK_ADC1_TRIGR3_TRIG15  0x80

#define MASK_ADC1_TRIGR4_TRIG0   0x01
#define MASK_ADC1_TRIGR4_TRIG1   0x02
#define MASK_ADC1_TRIGR4_TRIG2   0x04
#define MASK_ADC1_TRIGR4_TRIG3   0x08
#define MASK_ADC1_TRIGR4_TRIG4   0x10
#define MASK_ADC1_TRIGR4_TRIG5   0x20
#define MASK_ADC1_TRIGR4_TRIG6   0x40
#define MASK_ADC1_TRIGR4_TRIG7   0x80


/*-------------------------------------------------------------------------
 *      DAC register definitions
 *-----------------------------------------------------------------------*/
/* DAC channel 1 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EN          : 1;
  unsigned char BOFF        : 1;
  unsigned char TEN         : 1;
  unsigned char TSEL        : 3;
  unsigned char WAVEN       : 2;
} __BITS_DAC_CH1CR1;
#endif
__IO_REG8_BIT(DAC_CH1CR1,  0x5380, __READ_WRITE, __BITS_DAC_CH1CR1);

/* DAC channel 1 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char MAMP        : 4;
  unsigned char DMAEN       : 1;
  unsigned char DMAUDRIE    : 1;
} __BITS_DAC_CH1CR2;
#endif
__IO_REG8_BIT(DAC_CH1CR2,  0x5381, __READ_WRITE, __BITS_DAC_CH1CR2);

/* DAC channel 2 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EN          : 1;
  unsigned char BOFF        : 1;
  unsigned char TEN         : 1;
  unsigned char TSEL        : 3;
  unsigned char WAVEN       : 2;
} __BITS_DAC_CH2CR1;
#endif
__IO_REG8_BIT(DAC_CH2CR1,  0x5382, __READ_WRITE, __BITS_DAC_CH2CR1);

/* DAC channel 2 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char MAMP        : 4;
  unsigned char DMAEN       : 1;
  unsigned char DMAUDRIE    : 1;
} __BITS_DAC_CH2CR2;
#endif
__IO_REG8_BIT(DAC_CH2CR2,  0x5383, __READ_WRITE, __BITS_DAC_CH2CR2);

/* DAC software trigger register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SWTRIG1     : 1;
  unsigned char SWTRIG2     : 1;
} __BITS_DAC_SWTRIG;
#endif
__IO_REG8_BIT(DAC_SWTRIG,  0x5384, __READ_WRITE, __BITS_DAC_SWTRIG);

/* DAC status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char DMAUDR1     : 1;
  unsigned char DMAUDR2     : 1;
} __BITS_DAC_SR;
#endif
__IO_REG8_BIT(DAC_SR,      0x5385, __READ_WRITE, __BITS_DAC_SR);

